[{"slug":"greatest-commandment","title":"The Greatest Commandment","content":"<p>An explanation of the deep meaning I find in Jesus's greatest commandments</p>\n<div class=\"round-panel grayscale-10 mt-h mb-h\">\n    <p class=\"mt-0\">\n        One of the scribes came near and heard them disputing with one another,\n        and seeing that he answered them well he asked him, “Which commandment\n        is the first of all?” Jesus answered, “The first is, 'Hear, O Israel:\n        the Lord our God, the Lord is one; you shall love the Lord your God\n        with all your heart and with all your soul and with all your mind and\n        with all your strength.' The second is this, 'You shall love your neighbor\n        as yourself.' There is no other commandment greater than these.”\n    </p>\n    <p class=\"mb-0\"><i>Mark 12:28-31, NRSVUE</i></p>\n</div>\n<div class=\"round-panel grayscale-10 mt-h mb-h\">\n    <p class=\"mt-0\">\n        When the Pharisees heard that he had silenced the Sadducees, they gathered\n        together, and one of them, an expert in the law, asked him a question to\n        test him. “Teacher, which commandment in the law is the greatest?” He said\n        to him, “ 'You shall love the Lord your God with all your heart and with\n        all your soul and with all your mind.' This is the greatest and first\n        commandment. And a second is like it: 'You shall love your neighbor as\n        yourself.' On these two commandments hang all the Law and the Prophets.\n    </p>\n    <p class=\"mb-0\"><i>Matthew 22:34-40 NRSVUE</i></p>\n</div>\n\n<div class=\"round-panel grayscale-10 mt-h mb-h\">\n    <p class=\"mt-0\">\n        An expert in the law stood up to test Jesus. “Teacher,” he said, “what\n        must I do to inherit eternal life?” He said to him, “What is written\n        in the law? What do you read there?” He answered, “You shall love the\n        Lord your God with all your heart and with all your soul and with all your\n        strength and with all your mind and your neighbor as yourself.” And he\n        said to him, “You have given the right answer; do this, and you will live.”\n    </p>\n    <p class=\"mb-0\"><i>Luke 10:25-28, NRSVUE</i></p>\n</div>\n\n<p>See also:</p>\n\n<div class=\"round-panel grayscale-10 mt-h mb-h\">\n    <p class=\"mt-0\">\n        Hear, O Israel: The Lord is our God, the Lord alone.You shall lovethe Lord\n        your God with all your heart and with all your soul and with all your might.\n    </p>\n    <p class=\"mb-0\"><i>Deuteronomy 6:4-5 NRSVUE</i></p>\n</div>\n\n<div class=\"round-panel grayscale-10 mt-h mb-h\">\n    <p class=\"mt-0\">\n        You shall not take vengeance or bear a grudge against any of your people,\n        but you shall love your neighbor as yourself: I am the Lord.\n    </p>\n    <p class=\"mb-0\"><i>Leviticus 19:18 NRSVUE</i></p>\n</div>\n\n<p>\n    What better section of the Christian bible is there to study? If you care about what Jesus\n    has to say in the synoptic gospels, then this passage must be of primary importance.\n    I like all three of these versions for different reasons, but for the sake of this article\n    I will consider the Mark version. I break this down into six sections:\n</p>\n\n\n<h2>1. Hear, O Israel: The Lord your God is One</h2>\n<p>\n    This quote from Deuteronomy 6, known as the Shema, points to the oneness of God.\n    Although many people interpret this as merely saying that God is the only deity,\n    many people in Jewish, Christian, and Islamic people throughout history have used this\n    verse to support the idea that there is nothing outside of or apart from God. It is related to\n    Deut. 4:35: \"there is none besides Him [God]\". The Shahada, foundational to the beliefs\n    of Muslims, states \"There is no god but God\". To me, and to many mystics, Kabbalists,\n    Hasidic Jews, and Sufis throughout history, this points to the oneness and unity of\n    everything in the universe, and unity with God. Further, in John 17:20-23, Jesus prays\n    that we all be one, and one with the Father, just as Jesus himself is one with the Father,\n    that He loves us just as he loves Jesus. \"Hear, O Israel, The Lord your God is One\"\n    then becomes a wake-up call, inviting us into that unity. Remember, we are all one!\n</p>\n\n\n<h2>2. Love the Lord your God</h2>\n<p>\n    Here we are being told to love the ultimate, the transcendent, the divine. Jesus claims\n    that we can take part in a relationship with God, a loving relationship described as heaven. \n    We can essentially take two attitudes towards God, either acceptance or rejection.\n    If we accept and love God, and foster this loving relationship, then our actions will\n    work in accordance with God. If we hate God, reject His creation, and become an enemy of\n    the divine, then there is no saving us. If hell is separation from God, then this is a\n    guaranteed path to hell. Since God is the creator and sustainer of the entire universe,\n    loving God also means reconciling yourself with the universe, and loving it too.\n</p>\n\n\n<h2>3. With all your heart, soul, mind, and strength</h2>\n<p>\n    The love that we are to have for God should be all-consuming. We must love with every fiber\n    of our being, and everything we have. Love should take up all of us. With our heart, we must\n    be compassionate. With our soul, we must be present and righteous. With our mind, we must be\n    wise and intelligent. With our strength, we must take action, especially difficult action, in\n    accordance with love.\n</p>\n\n\n<h2>4. Love your neighbor</h2>\n<p>\n    Presumably also with all our heart, soul mind, and strength.\n    God created everything, and everything is an expression of God. For us humans, our art is often\n    imperfect. It would be justifiable to love someone and not love their creation because our\n    creations aren't a reflection of our nature. Unlike humans, though, God does not make mistakes,\n    and God's nature is present in creation. So it is impossible to love God and not love creation.\n    Humans in particular, according to Genesis, have God's very breath in us and were made in God's\n    image. The majority of what Jesus talks about in the synoptic gospels is how to treat other\n    people well. We are told to do unto others what we would have done to us, to take care of the\n    orphans, widows, and immigrants, to feed the hungry, heal the sick, clothe the poor. Jesus always\n    talks about loving our neighbor not just as a fuzzy feeling in our chest, but as action.\n    In fact, in Luke, right after giving the greatest commandments, he is asked what it means to\n    love our neighbor. He responds with the parable of the good samaritan. Loving each other means\n    having compassion, taking care of each other, making sure we are well.\n</p>\n\n\n<h2>5. As yourself</h2>\n<p>\n    Don't forget, we are also a creation of God! Loving humans also means loving yourself.\n    Of course, this is not permission to be selfish and prioritize your own gain at the expense of others.\n    Neither is it a permission for excessive, decadent \"self-care\", which only serves our vanity and ego\n    while distracting us from what is really important. If loving yourself gets in the way of loving your\n    neighbor, or vice versa, then this is a problem. Like loving others, our love for ourself should be \n    an active love that seeks to improve our lives and wellbeing. You should be a friend to yourself.\n    Just like with others, you should give yourself compassion and forgiveness.\n</p>\n\n\n<h2>6. There is no other commandment greater than these</h2>\n<p>\n    Or, as Matthew says, \"On these two commandments hang all the laws and the prophets\".\n    I believe this gives us permission to interpret other verses of the bible in light of\n    these greatest commandments. If anything else in the bible contradicts the commands\n    to love God and love your neighbor, then this takes greater precedence. There is no\n    greater commandment, and the entire old testament (the laws and prophets) rely on this.\n    If you fulfill the commandment to love, then you are also fulfilling the entire law.\n</p>","tags":["Christianity"],"created":"4/15/2025","edited":"4/30/25","epistemicStatus":"Opinion, which I've thought about a lot but not researched much","completionStatus":"in progress"},{"slug":"lords-prayer","title":"The Lord's Prayer","content":"<div class=\"round-panel grayscale-10 mt-h mb-h\">\n    <p class=\"mt-0\">\n        Pray, then, in this way:\n        Our Father in heaven,\n        may your name be revered as holy.\n        May your kingdom come.\n        May your will be done on earth as it is in heaven.\n        Give us today our daily bread.\n        And forgive us our debts, as we also have forgiven our debtors.\n        And do not bring us to the time of trial,\n        but rescue us from the evil one.\n    </p>\n    <p class=\"mb-0\"><i>Matthew 6:9-13, NRSVUE</i></p>\n</div>\n\n<p>\n    I use this passage as a template for contemplative prayer.\n    When I pray this way, I break it into 7 sections:\n</p>\n\n<h2>Our Father in heaven</h2>\n<p>\n    I think about the oneness of God and\n    <flink [href]=\"routes.ChristUnity\">the unity of God and all things</flink>.\n</p>\n\n<h2>May your name be revered as holy</h2>\n<p>\n    (Or, \"Hallowed be thy name\"). I think about my reverence for God and rest in a place of\n    divine love for a bit. I see God and all of God's creation as holy. I try to see God\n    in everybody (as in Matthew 25), and see them as holy, too.\n</p>\n\n<h2>May your kingdom come. May your will be done on earth as it is in heaven</h2>\n<p>\n    See my article on <flink [href]=\"routes.ChristKingdom\">the Kingdom of Heaven</flink>.\n    It is an affirmation that I am committed to making the earth more like divine paradise.\n    It is a reminder for righteousness. I ask \"What do I need to do today to help bring\n    about God's kingdom on earth?\", and \"What do I need to be moving towards in the long-term?\".\n    And it is hope, that one way or another, the world will change to become heavenly.\n</p>\n\n<h2>Give us today our daily bread</h2>\n<p>\n    Here I think about any immediate needs for myself or others, and pray that\n    these needs are fulfilled.\n</p>\n\n<h2>Forgive us our debts</h2>\n<p>\n    I think about anything I did wrong, anything I am guilty of. Just asking \"what am I guilty of\"\n    will bring several instances in mind. I ask for forgiveness, repent, and think about how\n    to avoid this in the future. This step is aimed at making me a better person over time.\n</p>\n\n<h2>As we also have forgiven our debtors</h2>\n<p>\n    Think about any grudges I hold against others or anyone I need to forgive, and forgive them.\n</p>\n\n<h2>Do not bring us to the time of trial, but rescue us from the evil one</h2>\n<p>\n    (or, \"Lead us not into temptation\"). Think about any sins or temptations that I am\n    facing, either temptations that recur daily, or temptations I predict I will face\n    at some point today. Commitment to doing what is right in those moments.\n</p>\n\n<h2>Gratitude</h2>\n<p>\n    This isn't part of the Lord's prayer, I'm just describing how I pray now.\n    After I finish with those 7 points I then take some time to pray about what I am grateful for.\n</p>","tags":["Christianity"],"created":"4/23/2025","edited":"4/23/2025","epistemicStatus":"Opinion. I've thought about this a bit but haven't researched into it","completionStatus":"draft"},{"slug":"good-list","title":"Good List","content":"\n<p>\n    An ongoing list of things that I can do to try and make the world a better place.\n    This is for inspiration; there are several things here that I don't do, or don't do well, and that's ok.\n    Some items here are significantly more or less effective than others.\n</p>\n\n\n<h2>Things to Do</h2>\n<ul>\n    <li>Career can generate lots of good (or lots of bad) (<a href=\"\">80,000 hours</a>)</li>\n    <li>Volunteering</li>\n    <ul>\n        <li>Homeless shelters</li>\n        <li>Soup kitchens, Food banks</li>\n        <li>Hotlines - TODO list some</li>\n        <li><a href=\"https://www.habitat.org\">Habitat for Humanity</a></li>\n        <li><a href=\"https://www.mealsonwheelsamerica.org\">Meals on Wheels</a></li>\n        <li><a href=\"https://www.charitynavigator.org\">Charity navigator</a></li>\n    </ul>\n    <li>Using your skills to benefit others for free or at cost</li>\n    <li>Ask your neighbors if they need help with anything- meals, yard work, babysitting / pet sitting, etc.</li>\n    <li>Pick up trash in your neighborhood</li>\n    <li>If you drive by someone walking in a storm, possibly offer them a ride. This can be dangerous,\n        and accepting rides from strangers is dangerous, so only do this if you are comfortable with it.\n    </li>\n</ul>\n\n<h2>Connection</h2>\n<ul>\n    <li>Give someone a genuine compliment</li>\n    <li>Be good to people you live with- family, roommates, etc.</li>\n    <li>Listen to people. A lot of people just want to be seen, heard, and validated.</li>\n    <li>Spend quality time with others</li>\n    <li>Show appreciation to those you love</li>\n    <li>Call someone if you know they're having a bad day or going through something difficult</li>\n</ul>\n\n\n<h2>Things to Give</h2>\n<ul>\n    <li>Donate blood and/or platelets</li>\n    <li>Donate to charity</li>\n    <li><a href=\"https://www.effectivealtruism.org\">Effective Altruism</a> can tell you good places to donate to</li>\n    <li>Get stuff for free (dumpster diving, picking fruit on public property, etc.) and donate itz</li>\n    <li>Tithing (if you like how the church spends it)</li>\n    <li>Give away things you no longer use</li>\n    <li>Give to food drives</li>\n    <li>Tip your waiters well (fellow Americans)</li>\n    <li>Pay it forward for the next person. (I don't like doing this but some do)</li>\n    <li>When you see someone in need, give them what they need</li>\n</ul>\n\n\n<h2>Organization</h2>\n<ul>\n    <li>Worker's union or tenant's union</li>\n    <li>Political action, protesting</li>\n    <li>Educating others</li>\n    <li>Work to establish and develop mutual aid networks</li>\n    <li>Join a political party or movement you agree with. Attend their meetings.</li>\n</ul>\n\n\n<h2>Consumption</h2>\n<ul>\n    <li>Consider vegetarianism, veganism, or reducing meat. This significantly decreases animal suffering.</li>\n    <li>Prefer buying locally instead of big companies</li>\n    <li>Buy from companies that don't do child labor and sweat shops</li>\n    <li>\n        Reduce consumption. Pretty much all consumption has negative ethical and environmental impacts.\n        You don't need to become a hermit or anything, but reduce some of the excess.\n    </li>\n    <li><a href=\"https://www.ethicalconsumer.org\">Ethical Consumer</a></li>\n    <li>Reduce your negative impact on the environment</li>\n    <ul>\n        <li>Use less single-use plastic</li>\n        <li>Prefer biking, walking, public transport, and carpooling. Try to not fly when possible.</li>\n    </ul>\n</ul>\n\n\n<h2>Indirect Ways</h2>\n<p>Essentially sharpening the axe. Things that don't necessarily do direct good, but increase your capacity for doing good.</p>\n<ul>\n    <li>Improve your skills, lifestyle, situation, etc.</li>\n    <li>De-stressing</li>\n    <li>Expand your networks and communities</li>\n</ul>","tags":[],"created":"4/3/2025","edited":"4/15/2025","epistemicStatus":"Some research went into this, but I need to do more research. And I need to actually do more of this instead of just thinking about it.","completionStatus":"in progress"},{"slug":"core-beliefs","title":"Core Beliefs","content":"<p>\n    CONTENT WARNING: The following ideas may be uncomfortable, especially among people prone to dissociation,\n    depersonalization, or derealization. It may challenge some of your own beliefs. Read at your own risk.\n</p>\n<p>\n    This list of my core beliefs is the culmination of my spirital seeking from my late teens / early 20's,\n    and informs my mission statement. It is therefore the foundational bedrock of my life system.\n    I am not trying to convince you of anything here. I'm not evangelizing, just offering up these ideas\n    in case you're interested. As always, feel free to leave your own ideas in the comments.\n</p>\n\n<!-- #region 1. Unity -->\n<h2>1. Everything is essentially one</h2>\n<p>\n    We percieve the world as several separate objects. I am separate from you and the rest of the world,\n    the bee is separate from the hive and the flowers, this is separate from that. My claim here is that\n    this apparent separation is not a true representation of the world. Although the bee, flower, and hive\n    are somewhat distinct, their difference is like the difference between two waves in the same ocean.\n    You can point to the boundary of each wave, just as you can point to the outline of the bee and the outline\n    of the hive. But both waves are manifestations of the same underlying ocean, and all bees, hives, and\n    flowers are manifestations of the same system. Bee colonies act very similarly to different cells in our\n    bodies. Different bees perform different roles, which all come together for the collective survival of\n    the entire hive. The entire hive is therefore a superorganism with just as much existential validity\n    as you or me. In much the same way, all hives, all pollen-producing plants, all other pollenators and\n    insects forms a cohesive system. The entire global biosphere is a cohesive system, one giant superorganism.\n    We and all other creatures are facets of that superorganism. We could likewise point out the borders between\n    our individual organs, or individual cells, or even atoms, and call them separate objects. Wherever we decide\n    to draw the line between separate objects, that line is arbitrary and exists only in our head. There\n    are no dividing lines in the real world, and thus no separate objects, apart from us inventing them.\n</p>\n<p>\n    I don't believe our material bodies are truly separate. We continuously take in food, water, air, \n    sense data, etc., and we are continuously outputting matter and energy. We are not a closed system.\n    The matter that makes you up changes all the time. As Alan Watts says, we are like whirlpools in water-\n    you can see a persistant pattern, but the water that makes it up is always changing. So we have no material\n    bodies which are separate from the rest of the world, they are just material manifestations of the world.\n</p>\n<p>\n    The same is true with patterns and movement. What controls celestial bodies, rivers flowing, and trees growing?\n    The laws of physics (or, rather, the underlying patterns which laws of physics are attempting to describe).\n    The same underlying laws of physics control all of these movements and patterns. The same is true about us.\n    Our brains, which determine our actions, perception, and thoughts, are similarly controlled by the laws of\n    physics. In other words, that which controls me also controls you, and the rest of the universe. So there is\n    no separate, distinct thing which I can call \"my mind\".\n</p>\n<p>\n    I believe the same is true about consciousness. I'm not really sure how consciousness works (I don't think\n    any reputable person is sure about this). But if I had to guess, I would say that each of our individual\n    points of consciousness are just manifestations of the greater underlying cosmic consciousness, in much the\n    same way that our minds are manifestations of the laws of physics, and our bodies are manifestations of\n    the material world. Perhaps it is some sort of field, like the electromagnetic field. Our bodies are like circuits,\n    our minds are like the logic the circuits are running, and our individual consciousnesses are like the\n    electromagnetic effects which the circuits produce. It appears to produce its own electromagnetic field,\n    but there is really only one electromagnetic field which spans the entire universe. This metaphor might\n    be wrong, but I think the idea that all our consciousnesses are aspects of an underlying system is probably right.\n</p>\n<p>\n    This idea has many consequences. I don't think we have free will (in the libertarian sense; compatabilism\n    may be true in some way). I also don't think we stop existing when we die; our bodies stop working, but\n    our underlying essence- the entire universe- continues, and we continue on through that process. One large\n    consequence is that we are in unity with everything good in this universe, and everything bad as well.\n    Infinite bliss and infinite suffering. This confrontation is addressed in belief 2:\n</p>\n<!-- #endregion -->\n\n\n<!-- #region 2. Acceptance -->\n<h2>2. Rejection or Acceptance</h2>\n<p>\n    So, the entire universe is one, and we are one with the whole thing. We can choose to respond to that\n    in two ways: rejection or acceptance.\n</p>\n<p>\n    Rejection is being against the world, or posturing yourself in opposition to the totality of the universe.\n    There are legitimate reasons to take this posture. The world is full of both conscious suffering and\n    moral evil. It can feel meaningless, resulting in a nihilistic loathing for existence. You may be depressed\n    and just want it to end. After realizing that all is one, you could be filled with cosmic loneliness-\n    I am the only thing that exists, omnipresent and omnilonely. For any of these reasons (or some other reason\n    I have not thought of), you might view the universe, and God if you believe in that, as something that\n    ought not exist.\n</p>\n<p>\n    If you are in this camp, it may comfort you to know that you aren't the first person to experience this.\n    You absolutely can move through it into a posture of acceptance. I am proof of this.\n</p>\n<p>\n    The other response is acceptance. This is looking at the whole universe, the good and the bad, and choosing\n    to say \"it is well with my soul\". It is not pretending that the bad does not exist or trying to ignore it.\n    You must be able to fully embrace the evil within yourself and the world, which is no small feat. If you can\n    do this, then you will find that there are even more reasons to love the world. You will be able to find\n    beauty in everything. Joy and sorrow are both beautiful, and life is worth living until the last second.\n</p>\n<p>\n    If I could freely choose one or the other, rejection or acceptance, I think the decision is obvious.\n</p>\n<!-- #endregion -->\n\n\n<!-- #region 3. Love -->\n<h2>3. Love</h2>\n<p>\n    Once you have experienced the unity of everything and have accepted it, the obvious implication is that\n    you ought to love everything in it. If you truly enbrace the universe, or God, the source of the universe,\n    then you ought to love everything in it. You see the beauty in the galaxies and landscapes. More importantly,\n    you love consciousness itself, and each of the creatures through which consciousness is expressed.\n</p>\n<p>\n    Love can be used in several different ways. It could be a momentary feeling - a flutter in your chest. It could\n    express a preference or something you enjoy: \"I love ice cream\". A deeper meaning is devotion or care for\n    someone even when you don't feel it or have that preference: \"I love you even though you are making me mad\".\n    Unlike the first two, you have to choose to have this love every day. Words are cheap, but this type of love\n    is expressed through action. When Jesus was asked what it means to love your neighbor, he gave the story of the\n    good samaritan. Love means taking care of someone, figuring out what they need and doing everything in your\n    power to make sure they get it.\n</p>\n<p>\n    I believe that the call to compassionately love everyone necessarily follows from the first two beliefs.\n</p>\n<!-- #endregion -->\n\n<h2>4. The Three Virtues</h2>\n<p>\n    The obvious next question is, how should we love each other? We already have compassionate love, but how\n    should we live our lives in order to maximize the expression of this love? What types of action follow\n    from the first three beliefs? I believe that it essentially boils down to three virtues: wisdom, \n    strength, and presence.\n</p>\n<p>\n    Wisdom is essentially our navigation system. It points us to where we want to go and tells us what actions\n    will take us closer or further from it. Thinking about the stuff on this page, and on my Life Systems page,\n    have been good sources of wisdom for me (and I hope they give you some, too). Contemplation, reading good\n    books, and direct life experience can all produce wisdom.\n</p>\n<p>\n    Once you know what you should do, strength or discipline is getting it done. This is the engine.\n    It requires grit and perseverance to do anything worth doing. I'm not entirely sure how to develop\n    this type of strength, but I currently conceptualize it as a muscle, which can be trained by\n    repeatedly doing the hard stuff. Every time you do something hard, you're putting in reps.\n    There is also a degree of developing strength in different disciplines as well- being able to lift\n    heavy things, run fast, focus, think quickly, developing skills so you have the physical ability to\n    do stuff. This of course should be guided by compassion and wisdom.\n</p>\n<p>\n    Presence is being in the moment, undistracted. In life we are constantly tempted to fall into a type\n    of sleep, to lose awareness of the big picture. Presence fights against this, allowing us to stay\n    in the moment, remembering what is actually important. Presence is also the appreciation of the\n    current moment. It is easy to miss the beauty of the moment, like the child who mindlessly eats an\n    ice cream cone and only notices when it is all gone. Presence is the refusal to be distracted by\n    thoughts of the past or the future, and refusal to numb one's mind through passive consumption.\n</p>\n<p>\n    These are broadly the three virtues that I try to live in my day-to-day life. You could get into the\n    specifics of sub-virtues (e.g. strength -> courage, resiliance, self-control, ...) or come up with\n    a different list. I just try to keep it simple so it is easy to remember. Wisdom, strength, and\n    presence- good mind, good body, good soul.\n</p>\n\n<h2>Conclusion</h2>\n<p>\n    So that's my belief system. I try to keep it epistemologically light. Only four points- unity,\n    acceptance, love, and virtue. It used to be a lot longer and more complex, but I've whittled it\n    down into the most essential and justifiable form. I believe everything is straightforward and\n    can be logically supported. I also think it is compatable with pretty much any religion, philosophy,\n    and political belief (at least I don't know of one that this is incompatable with).\n</p>\n<p>\n    If you'd like to hear how I connect this directly to Christianity, see\n    <a [href]=\"routes.ChristCommandment\">my thoughts on Mark 12:28-31</a>\n</p>","tags":["Life Systems"],"created":"4/14/2025","edited":"4/15/2025","epistemicStatus":"I've spent several years thinking and researching into this. I always wish I had specific sources and better research though. And I know most people don't agree with me.","completionStatus":"in progress"},{"slug":"life-goals","title":"Life Goals","content":"\n<p>\n    I think it is healthy to have an overarching goal to one's life.\n    What is the ultimate goal you're pursuing?\n</p>\n<p>\n    There are a few goals I believe are ultimately unfulfilling in themselves.\n    They may be used as instrumental goals, but not as main goals.\n</p>\n<ul>\n    <li>Wealth accumulation</li>\n    <li>Power or influence</li>\n    <li>Hedonism</li>\n</ul>\n<p>\n    There are several goals I think are valuable as overarching goals:\n</p>\n<ul>\n    <li>Furthering knowledge and science</li>\n    <li>Eudaimonia</li>\n    <li>Artistic expression</li>\n    <li>Flourishing social connections</li>\n    <li>Improving the lives of others</li>\n    <li>Spiritual attainment</li>\n</ul>\n","tags":["Life Systems"],"created":"4/24/25","edited":"N/A","epistemicStatus":"Just my opinion","completionStatus":"seed"},{"slug":"life-systems","title":"Life Systems","content":"<!-- #region Intro -->\n<p>\n    One possible way to think about human beings is as a collection of several interconnected systems.\n    The goal is to optimize the health and wellbeing of the entire organism, and mobilize the system's\n    resources to accomplish whatever goals we find most important. Each of these systems can be\n    broken down into subsystems and so on depending on what level of detail is most useful. Reaching\n    our goals require both improving each system, and improving how the system aligns with our overall\n    goals. \n</p>\n<p>\n    I use the term \"system\" here because each of these areas of life have inputs, outputs, resource flows,\n    and processes. It is similar to a car, which is a complex system with several subsystems- powertrain,\n    steering, suspension, etc. Each subsystem has several parts to it, which themselves are smaller systems.\n    When one part isn't serving the goals of the entire car (or driver), it is repaired or replaced.\n    For each area in life, you are also a single node in a much larger community, national, or global\n    system; for instance, your personal finance system is a single node in the global economic system,\n    and your social network is one part of your community's social network. This is further reason to\n    improve aspects of your life. Not only will it help you reach your goals and improve your personal\n    health, it will also help other people who are connected to the same networks as you.\n</p>\n<p>\n    Another useful framing of this is \"areas of health\" instead of \"system\". This article is talking about your\n    physical, mental, spiritual, social, financial, etc. health. You can imagine you're in a video game,\n    and your character has several health bars, each of which need to be managed. I will continue to\n    conceptualize this as interlocking systems though.\n</p>\n<p>\n    This was loosely inspired by the Wheel of Life exercise. That exercise asks you to look at 8 particular\n    areas in your life and rate them from 1-10, then describe what your life would look like if you\n    were at a 10 in each of them. Or something like that, I've never actually done the exercise. Something\n    similar could definitely be done here- look at each category and rate your health, and envision what\n    lifestyle you would have at a 10.\n</p>\n<p>\n    I believe reaching a 10 in each area would be implausible; it would take way more than 24 hours\n    each day and way more resources than most people have. But I personally don't think I need all\n    areas to be maxed out. I think several of them can be around 7-8, healthy enough they don't cause\n    problems, but not consume too many resources. Perhaps you should aim for one or two of them to be \n    10's. Then the operative question is, what score do I want in each area, what would that level look\n    like, and what resources and actions would be necessary for this?\n</p>\n<p>\n    There are several principles I am looking for in each system:\n</p>\n<ul>\n    <li>\n        <b>Intentionality</b> - If you don't intentionally plan stuff out and think about stuff, then you will\n        do stuff based on whims and dopamine circuits. This is prime real estate for corporations, advertisers,\n        political entities, etc. to take advantage of you, and manipulate your actions to benefit themselves.\n        If you think through everything systematically, then you will be better able to transform your life into\n        and achieve what you want.\n    </li>\n    <li>\n        <b>Cognitive Offloading</b> - You don't want to spend a lot of effort making decisions each day. We have\n        finite cognitive resources; using those resources on mundane tasks that can be offloaded results in more\n        stress and worse decisions. As you automate decisions and organize systems in helpful ways, you will automatically\n        know what needs to be done. Offloading can also reduce feelings of stress or guilt. Mechanisms for offloading\n        include reminders, lists, and better organization systems.\n    </li>\n    <li>\n        <b>Compound growth</b> - If you can make something improve at an exponential rate, do it.\n        The most well-known example is finances, where the amount of returns you get from investments\n        is proportional to the amount you have invested. Friendships, communities, learning, and many\n        other areas can follow similar patterns, where the longer you let it grow, the larger and faster\n        it can grow. Having long time horizons (being able to wait a long time for success) really helps here.\n    </li>\n    <li>\n        <b>Diversity</b> - The health of a system is often tied to its diversity. For instance, biodiversity\n        is a very strong indicator for the health of an environment. This can be a type of compounding.\n        Gaining a diversity of skills that build on each other is better than mastering a single skill.\n        Gaining diverse friends or consuming diverse ideas greatly improves your social and intellectual lives.\n    </li>\n    <li>\n        <b>Automation</b> - Many of these systems can be automated, or only require one-time improvements.\n        This is ideal so we don't have to continually invest resources (time, energy) into an area, but can\n        still collect the benefits. For instance, in your financial system, you can create automatic deposits,\n        card payments, and investments, so you don't even have to think about anything when you get paid.\n    </li>\n    <li>\n        <b>Stacking</b> - Doing something that accomplishes two things at once make you twice as productive.\n        Running with my dog gives me exercise and is treating my dog well. Sports with friends hits social and\n        physical health. This is not to be confused with multitasking, which usually results in doing 2 things\n        very poorly, and often involves a lot of context switching.\n    </li>\n</ul>\n<p>\n    Enough yapping, let's see the list already!\n</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Purpose, Meaning, Goals -->\n<h2>Purpose / Meaning / Goals</h2>\n<p>\n    This isn't really a system, but I put it here first because it should be your north star or guiding principle.\n    Finding purpose or meaning in your life, coming up with an overarching life goal and intermediate\n    goals to reach it, can help you determine how you want to manage all other systems.\n</p>\n<p>\n    What is your guiding principle? If you could do anything, be anyone, what would you want to do and\n    who would you want to be? There are many valid answers to this question. Some examples of good guiding\n    goals include personal happiness and wellbeing, wellbeing for your family, artistic self-expression,\n    science and knowlede, or spiritual / religious attainment. Beneath the overarching principle could be\n    a large goal for how you want to achieve it. This can help you create a mission statement.\n</p>\n<p>\n    My personal mission statement is, \"To improve the lives of people around me, especially the most\n    marginalized or in-need, through compassion, giving, and community-level mutual aid systems\".\n</p>\n<p>\n    Having a mission statment like that can allow you to more deeply analyze what is most important and how\n    to get there. After contemplating about how I can improve the lives of others, I came up with this list:\n    Ways of Doing Good. The health of this purpose / meaning / goals system is directly proportional to how\n    well I am following that list. Regularly examining how your life aligns with your mission will ensure\n    you're making the most of your time and effort.\n</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Time -->\n<h2>Time system</h2>\n<p>\n    An organism's time system is probably their most important system to manage well. How you spend your time\n    dictates what areas of your life improve or worsen. By default, we do not deliberately think about this,\n    and how we manage our time is based on whims and outside influences.\n</p>\n<p>\n    It is probably too extreme to overhaul your entire life and the way you spend your time in one go.\n    This could result in burnout or giving up. It may be better to gradually introduce a couple rules at\n    a time. At first, this may be regulating when you sleep and work, then progressively regulate more tasks\n    or blocks of time. A mature time management system would automate time-related decisions, so if you just\n    follow the system you are guaranteed to get your stuff done and improve in several key areas of life,\n    spending your time in a way that aligns with your core values.\n</p>\n<p>\n    If you're building your time system, it may be a good idea to schedule a weekly or monthly evaluation of the entire\n    system, so not only are individual areas of your life improving, the system by which you manage these areas is\n    also improving.\n</p>\n<p>\n    Some tools I use to help manage time:\n</p>\n<ul>\n    <li>\n        Calendar - I used to use this to block off repeated tasks so I can see what I'm doing when on each day.\n        I found this to be too strict, so I switched to using event lists.\n    </li>\n    <li>Task list for repeated events, which allows me to easily see what I'm supposed to do today</li>\n    <li>\n        Event list to keep track of one-time events. This and the task list can be viewed together on one\n        calendar for planning, though I don't often use this\n    </li>\n    <li>To-do lists, organized in an Eizenhower matrix. One of my repeated events is working on to-do tasks to make sure it doesn't build up</li>\n    <li>Habit tracker</li>\n</ul>\n<p>You can see my full management system on this page: Implementing Life Systems.</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Social -->\n<h2>Social systems</h2>\n<p>\n    This isn't a single system, it's a category of systems. Your family, relationships with individual friends,\n    friend groups, communities, and romantic relationships are all their own systems. The health of your family\n    might be much different than the health of your church or club community, for instance.\n</p>\n<p>\n    In general, I believe that having good social connections is one of the most important factors for your\n    overall wellbeing. I think of it as four areas- family, friends, communities, and romance / partnership.\n    I personally have no interest in the romance / partnership aspect but the other three are very important\n    to me. There are many options for community connections - neighborhood, work, school, church, hobbies,\n    sports, clubs, even being a regular at a restaurant or bar.\n</p>\n<p>\n    Keeping track of each person or group, the health of that relationship, and the last time you did something\n    with them can help visualize and proritize. Figuring out a target level of interaction with that person or\n    group would also be useful - e.g. I want to call each of these friends once a month, hang out with this group\n    every other week, and spend quality time with my parents / siblings once a week. Having that conversation with\n    the people involved could also be a powerful way to make sure everyone's on the same page about how you want\n    to spend time together, and how much. (Deciding how you want to relate with other people is a key concept in\n    relationship anarchy- I recommend you check it out if you haven't heard of it before)\n</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Physical health -->\n<h2>Physical health</h2>\n<p>\n    The body is essentially a mechanical system. It has input requirements (e.g. food, water), maintenance requirements\n    (e.g. health checkups, repairs), and usage requirements (e.g. movement / exercise, sleep). It is also the\n    vehicle by which you are able to operate in your life. If you have physical health problems, it will reduce your\n    resources and cause strain to all other areas of health. This quote is attributed to Abraham Lincoln: \"Give me 6 hours\n    to chop down a tree and I would spend the first 4 hours sharpening my axe\". Improving your body is one way to sharpen\n    the axe and improve your ability in all other areas.\n</p>\n<p>\n    Everyone has their own list of \"the X pillars of physical health\". As far as I'm concerned, there are really four\n    that will have the largest results: diet, exercise, sleep, and risk prevention.\n</p>\n<p>\n    <b>Diet</b> - Plan weight, calory, and macronutrient goals. Meal planning / prepping / tracking takes more effort but\n    can take your dietary  system to a higher level. There are other levers you can pull like intermittent fasting or dietary\n    restrictions.\n</p>\n<p>\n    <b>Exercise</b> - Plan how much of each type of exercise you want (e.g. X minutes of cardio, Y minutes of \n    strength each week), which parts of the body you want to strengthen, potentially come up with detailed exercise\n    plans. Some small lifestyle changes can improve exercise, like walking while taking calls, biking to the grocery\n    store instead of driving, or walking your dog every day. \n</p>\n<p>\n    <b>Sleep</b> - Improve the sleep environment (temperature, light, noise, comfort), what you do before bed (limits to\n    caffeine or technology, nighttime routine), and get into a regular sleep routine with little to no variation in sleep \n    or wakeup times.\n</p>\n<p>\n    <b>Risk prevention</b> - See below \"Safety / Emergencies\" section\n</p>\n<p>\n    Obviously there are other areas of physical health I haven't mentioned, and any of these areas could have entire books\n    written about them. I'm not an expert so you probably want to do a lot of further research.\n</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Mental health -->\n<h2>Mental / Emotional health</h2>\n<p>\n    I honestly haven't done too much research into this, so I don't have a very comprehensive framework for thinking about it.\n    Obviously your health in any other area will affect this. Exercising improves mood, having bad finances increases stress, etc.\n    Apart improving these other systems, there are several things that I find helpful: spending time in nature; destressing and destimulating;\n    processing emotions through journaling, self-expression, and therapy.\n</p>\n<p>\n    One interesting idea relating to this is that a human isn't a single distinct and unchanging self, but are rather composed of several\n    distinct selves, with their own goals, behaviors, and preferences. The book \"Your Symphony of Selves\" by James Fadiman and Jordan Gruber\n    argues that everybody is a multiplicity of selves. The internal family systems therapy model has similar claims. One imporant feature\n    of mental health, then, is recognizing what each part of you wants and harmonizing with yourself. This can address self-sabotoge or\n    self-hatred and make sure that 100% of you is happy with your life.\n</p>\n<p>\n    I feel like a lot of discussion about mental health in the current culture is centered on therapy, emotional regulation,\n    trauma, stuff like that. Not as many people are talking about learning, puzzles, reading and other intake of information,\n    that sort of stuff. Just like the body, the mind needs exercise to stay sharp. I have heard books described as \"mental\n    calisthenics\" and \"reading is conversing with ancient geniuses\". Learning new skills also seems great for mental health\n    and personal development. I've also heard that spending time with your own thoughts, whether through journaling or walking\n    in solitude or any other way, is good mental exercise. As I research more into the mental health system, I'll try to build\n    something that takes care of both the \"therapy\"-ish stuff and the \"crosswords\"-ish stuff.\n</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Spirituality -->\n<h2>Spirituality / Religion</h2>\n<p>\n    This is one component that I don't think everyone has to have. It is similar to romantic relationships in that way.\n    Religious groups often provide community, practices for personal growth, wisdom texts, community service opportunities,\n    and many other benefits. But connecting with the divine, whatever you believe that to be, seems to have benefits that go\n    beyond the effects of organized religion. This can include feelings such as peace, awe, gratitude, or love, feeling that\n    one is connected with the whole universe, a sense of deep purpose in your life. If you decide spirituality and religion\n    belong in your life, it is worth planning out what events and practices this entails, and what you plan to get out of it.\n</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Finances -->\n<h2>Finances</h2>\n<ul>\n    <li>Pay off any high interest debt</li>\n    <li>Reduce expenses where possible; cook instead of eating out, do cheaper hobbies, analyze your subscriptions</li>\n    <li>Have and follow a budget</li>\n    <li>Have a long-term financial plan, e.g. when certain debts will be paid off, at what rate you'll save for a house, etc.</li>\n    <li>Have a retirement plan</li>\n    <li>Invest what you can. Long-term compond interest exponentially multiplies your money</li>\n    <li>Increase income with a side hustle, working towards raise / promotion, or by changing jobs</li>\n    <li>Regularly review your purchases and overall financial picture to ensure you're still on-track</li>\n</ul>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Posessions / House / Environment -->\n<h2>Posessions, Home, Chores, Environment</h2>\n<p>\n    This is a pretty broad category that encapsulates the physical space your life occupies and all of the stuff you own.\n</p>\n<p>Common chores to be done frequently (daily or weekly basis):</p>\n<ul>\n    <li>Putting away stuff</li>\n    <li>Sweeping and mopping floors (and below couches, furniture, etc.)</li>\n    <li>Laundry</li>\n    <li>Washing dishes</li>\n    <li>Cleaning surfaces (and underneath appliances and other objects)</li>\n    <li>Checking your mail</li>\n    <li>Taking out trash and recycling</li>\n    <li>Cleaning stove, oven, and other appliances</li>\n</ul>\n<p>Common maintenance tasks to be done less frequently (weekly or monthly basis):</p>\n<ul>\n    <li>Use dishwasher cleaner on the dishwasher</li>\n    <li>Clean out dishwasher filter</li>\n    <li>Replace air filter</li>\n    <li>Yard work - Mowing, weeding, trimming, raking</li>\n    <li>Car - Getting gas, oil changes, cleaning, tire rotations, other maintenance and repair tasks</li>\n    <li>Maintenance for any other belongings you have</li>\n    \n</ul>\n<p>Ways to improve your physical environment</p>\n<ul>\n    <li>\n        Make it prettier. Make your environment encourage a headspace you like. \n        This could involve getting art, painting the walls, chainging decor / furniture, landscaping, etc.\n    </li>\n    <li>Grow a garden</li>\n    <li>Get water filters instead of drinking tap or bottled water</li>\n    <li>Get air filters in addition to your A/C if you have bad air quality</li>\n    <li>Organize your stuff so you can always find what you need, and stuff you don't is hidden away (or get rid of it)</li>\n    <li>\n        Reduce friction for things you want to do (e.g. put your workout equipment in an easy to reach place) and\n        increase friction for things you don't want to do (e.g. put alcohol in a hard-to-reach and hard-to-see place,\n        don't let junk food into your house)\n    </li>\n    <li>\n        Organize for improving workflow. E.g. make getting dressed, starting the coffee maker, washing your face,\n        and brushing your teeth all in a convenient linear way. Another example is putting your alarm clock on the\n        opposite side of the room next to your light switch to help ensure you get up.\n    </li>\n    <li>Create space for deep work. If you have an office or separate room for work, make that a sanctuary from distraction.</li>\n    <li>\n        Are things organized in a way that causes more problems? For instance, my bed used to be next to my window, \n        which would open to allow my dog in and out of the house. This made my bed constantly dirty so I moved it.\n    </li>\n</ul>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Digital security -->\n<h2>Security / Privacy</h2>\n<p>\n    Most people these days have a digital life that's almost as significant as their physical life. Our entire digital\n    footprint is a node in a larger network- a network shared with corporations, advertisers, law enforcement,\n    the government, hackers, scammers, etc. I personally don't want these entities to have my data, and I definitely\n    want to be secure against identity theft and other attacks. Some digital security / privacy steps:\n</p>\n<ul>\n    <li>Making secure passwords, not re-using passwords, and using a password manager</li>\n    <li>Using multi-factor authentication on important accounts</li>\n    <li>Putting passwords or biometrics on your devices. Don't let anyone who has your devices log in.</li>\n    <li>Using VPNs</li> \n    <li>Learning how to avoid scams, malware, fishing, and suspicious apps / websites</li>\n    <li>Don't click random links, files, or email attachments. Don't plug in random flash drives.</li>\n    <li>Not sharing private information, incl. birthdate, full name, location, or family info</li>\n    <li>Encrypting your data and devices</li>\n    <li>Go though app permissions on your phone, laptop, Google account, etc. (Does every app need to know your location?)</li>\n    <li>\n        Move from insecure apps or apps that give your data to advertisers, trackers, governments, and law enforcement,\n        to more secure, encrypted, open-source apps that don't sell your data.\n        <ul>\n            <li>For privacy/security, you want apps that are FOSS (Free Open-Source Software) and \"privacy focused\" / \"privacy first\"</li>\n            <li>F-Droid and Droidify are useful to download many FOSS apps</li>\n            <li>Browsers are very insecure, not private, and easy to switch. Try Brave, Duck Duck Go, LibreWolf, and Firefox Focus- Tor if you want maximum security</li>\n            <li>The search engine your browser uses by default can (should) also be changed- Brave Search and Duck Duck Go Search are both good, there are many others</li>\n            <li>Proton can replace Google mail, drive, calendar, while giving you a password manager and VPN</li>\n            <li>Signal / SimpleX can replace messaging</li>\n            <li>YouTube frontends (Tubular, Grayjay, FreeTube, LibreTube) can replace YouTube and give a much better user experience. I'm using Tubular</li>\n            <li>Organic Maps or OsmAnd can replace Google Maps</li>\n            <li>Aurora Store can replace Google Play Store</li>\n            <li>Did you know your phone keyboard probably sends your keystrokes to Google or Apple? FUTO keyboard is the FOSS alternative.</li>\n            <li>LibreOffice can replace your office suite (Microsoft Word / Excel / etc.)</li>\n            <li>I believe GPTMobile is FOSS AI chat access, I need to look more into that though</li>\n            <li>Fossify can replace many default phone apps, and Canta can uninstall Android apps, if you really want to get into replacing everything</li>\n        </ul>\n    </li>\n    <li>Data broker removal services (like Incogni)</li>\n    <li>Email aliases for different services</li>\n    <li>Be careful about devices in your home with microphones or cameras. Alexa is always listening.</li>\n    <li>Malware detection and removal software, anti-viruses</li>\n    <li>Backup important data regularly</li>\n    <li>Keep software up-to-date to ensure latest security updates</li>\n    <li>Disconnect smart devices when possible (even things you don't normally think about, like printers)</li>\n    <li>Update your Wi-Fi password from the default on the router</li>\n    <li>Enable number lock with your phone service provider to prevent attackers switching your phone number to a new device</li>\n    <li>Remove your personal info from Google manually</li>\n    <li>Place a security freeze on your credit</li>\n    <li>Firewalls - I have to look more into this (<a href=\"https://www.youtube.com/watch?v=yKyjbeObQXg\">Interesting video on firewalls</a>)</li>\n    <li>Don't use websites that have HTTP instead of HTTPS. Your browser will pitch a fit if you try to access an HTTP page, heed its warning. </li>\n    <li>Apps that can detect Bluetooth trackers like AirGuard</li>\n    <li>Separating out user profiles on your phone / computer, or sandboxing apps. GrapheneOS does this (see below), I think some versions of Android allow user profiles but my phone doesn't :(</li>\n    <li>Freeze your SIM with your provider to prevent hackers from swapping it (SIM Swap Scam Protection, or Number Lock)</li>\n    <li><a href=\"https://www.ssa.gov/myaccount/security.html\">Create an account with social security</a> so that nobody else can.</li>\n    <li><a href=\"https://www.irs.gov/identity-theft-fraud-scams/get-an-identity-protection-pin\">Get your IRS identity pin</a> so no one else can file a tax return in your name.</li>\n    <li>\n        Place credit freezes at the 5 major agencies. This also legally compels them to stop selling your data to the brokers.\n        <a href=\"https://www.experian.com/freeze/center.html\">Experian</a>, \n        <a href=\"https://www.transunion.com/credit-freeze\">TransUnion</a>, \n        <a href=\"https://www.equifax.com/personal/help/article-list/-/h/a/place-lift-remove-security-freeze\">Equifax</a>,\n        <a href=\"https://www.chexsystems.com/security-freeze/place-freeze\">Chex Systems</a>,\n        <a href=\"https://www.innovis.com/securityFreeze/index\">Innovis</a>\n    </li>\n    <li>Turn off WiFi and Bluetooth when not in use; turn on airplane mode when possible. This helps prevent location tracking</li>\n    <li>Using multiple VoIP numbers instead of your cell (SIM) number</li>\n    <li>\n        (Advanced) Not using a SIM card, or using a SIM card in an external device. This\n        allows you to better control what information is sent to cell providers. A faraday bag\n        can further limit what data the SIM card transmits.\n        (<a href=\"https://www.youtube.com/watch?v=RyirQOCUUK8\">YouTube - No SIM? No problem!</a>)\n    </li>\n    <li>\n        (Advanced) Switching operating systems - Computers can use Linux distros like Tails,\n        for phones you can use a Google Pixel with GrapheneOS installed. CalyxOS, /e/OS, and\n        VoltageOS might be good but I haven't investigated.\n    </li>\n    <li>(Advanced) Use Tor instead of normal web browsers</li>\n</ul>\n<p>Sources I used / Further reading:</p>\n<ul>\n    <li><a href=\"https://ssd.eff.org\">Electronic Frontier Foundation - Surveillance Self-Defense</a></li>\n    <li><a href=\"https://www.privacyguides.org/en/tools/\">Privacy Guides Tool List</a></li>\n    <li><a href=\"https://www.reddit.com/r/degoogle/comments/1jat0va/privacy_cybersecurity_tips_for_beginners/\">\n        Reddit - Privacy & Cybersecurity tips for beginners\n    </a></li>\n    <li><a href=\"https://www.reddit.com/r/privacy/comments/1i42wwr/what_else_can_i_do_to_enhance_my_security_and/\">\n        Another interesting Reddit thread</a></li>\n    <li><a href=\"https://www.optoutproject.net/the-cyber-cleanse-take-back-your-digital-footprint/\">\n        The Cyber-Cleanse [I haven't gone through this one yet]\n    </a></li>\n    <li><a href=\"https://thenewoil.org/en/\">The New Oil [I haven't gone through this one yet]</a></li>\n    <li><a href=\"https://www.cryptoparty.in/learn/tools\">Crypto Party - Tools</a></li>\n    <li><a href=\"https://www.privacytools.io\">Privacy Tools</a></li>\n    <li><a href=\"https://www.techlore.tech/spa\">Really cool quiz</a> and <a href=\"https://www.techlore.tech/resources\">Resources</a></li>\n    <li><a href=\"https://nationalprivacytest.org/test\">Another cool quiz</a></li>\n    <li><a href=\"https://privacy4cars.com\">Cars are a privacy nightmare on wheels</a>, apparently</li>\n    <li><a href=\"https://inteltechniques.com/workbook.html\">IntelTechniques Data Removal Guide</a></li>\n    <li><a href=\"https://support.google.com/websearch/answer/12719076?hl=en\">Google article on how to remove your information</a></li>\n    <li><a href=\"https://rejectconvenience.com/forum/viewtopic.php?t=55\">Tool to read privacy policies</a></li>\n    <li>\n        Ultimate guide to an open-source life:\n        <a href=\"https://wiki.futo.org/\">Full article</a>, \n        <a href=\"https://www.youtube.com/watch?v=Gj6HqWCdk3s\">YouTube - Introduction</a>, \n        <a href=\"https://www.youtube.com/watch?v=Et5PPMYuOc8\">YouTube - Part 1</a>,\n        <a href=\"https://www.youtube.com/watch?v=3fW9TV1WQi8\">YouTube - Part 2</a>\n    </li>\n</ul>\n<p>\n    There is also a need for physical security and privacy. I have not thought about this much.\n</p>\n\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Data organization -->\n<h2>Data Organization / Digital Environment</h2>\n<p>\n    Just like your physical space, organizing your digital space can clear up mental clutter and help you\n    get tasks done more effectively. You can also set up your digital environment to encourage helpful\n    behaviors and habits.\n</p>\n<ul>\n    <li>\n        Organize your documents well. For instance, using the PARA method you would sort your files into\n        a Project folder with individual project sub-folders, Areas of improvement or responsibility, Resources\n        you are using, and Archived stuff you probably won't need to see any time soon. There are a lot of good\n        online resources going more in-depth on this method.\n    </li>\n    <li>Keeping files synced so you can access them where you need them</li>\n    <li>Going through and deleting / sorting old files, photos, etc.</li>\n    <li>\n        If you're like me, you have several notebooks, random notes in half a dozen places, lists, etc.\n        You probably want to digitize and organize those.\n    </li>\n    <li>Setup your apps, widgets, and home screens</li>\n    <li>Notifications - Who are you allowing to distract you?</li>\n    <li>\n        Setup device settings like mouse sensitivity, hot corners for Mac, keyboard shortcuts, toolbars,\n        and other various settings to make digital environments more comfortable and productive\n    </li>\n    <li>\n        If you are using VSCode, look into extensions. On many browsers you will want to add plugins.\n        Many other softwares will have ways to extend or customize their functionality.\n    </li>\n    <li>\n        Your digital environment can be configured to avoid a lot of advertisements, spam, and other clutter.\n        It is worth the effort. Check out FOSS software, ad blockers (maybe Brave browser), and notification settings.\n    </li>\n    <li>\n        Having different devices for different purposes can help a lot with organization. When I used to have everything\n        on my phone, I would often pull out my phone and completely forget why I did, and often get distracted with\n        other stuff. By having separate devices for media consumption and deciding to only use certain devices for certain\n        tasks (e.g. only use social media on the computer), it makes it much easier to focus and be intentional.\n    </li>\n</ul>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Media consumption -->\n<h2>Media Consumption and Entertainment</h2>\n<p>\n    Media consumption is something that can and should be regulated, in much the same way that you would regulate your\n    dietary consumption. I believe consumption is deeply tied with mental health. I've found that a lot of the stress\n    in my life actually comes from over-consumption and mental over-stimulation. In one day, we might consume more\n    media than the average person would consume in an entire month a few hundred years ago. This section addresses\n    making sure our media and entertainment are actually helping us and not hurting.\n</p>\n<ul>\n    <li>\n        The most important thing is mindfulness and intentionality. Pay attention to how you spend your time,\n        and how beneficial that use of technology actually is.\n    </li>\n    <li>Are you consuming media as a coping mechanism for unwanted feelings, like stress or boredom?</li>\n    <li>\n        How much time are you spending on social media, YouTube, Tik Tok, video games, etc.?\n        What is the opportunity cost of that spent time?\n    </li>\n    <li>\n        Keeping your phone on you significantly decreases your IQ, makes you less present, and disrupts sleep.\n        Put it far away when you are sleeping, want to be productive, or want to be more in the moment.\n    </li>\n    <li>\n        Something that helped with my YouTube addiction was disabling YouTube recommendations. On my Google account\n        settings I turned off YouTube history and wiped my pre-existing history. Now when I log into YouTube it just\n        shows me a blank page, so it's much harder for me to get sucked into the algorithms. I have to search or use\n        my Subscriptions page. (I eventually stopped using YouTube altogether- see next point)\n    </li>\n    <li>\n        On a similar note, if you use YouTube a lot, you might want to check out alternate YT frontends, like Tubular.\n        They can allow you to play videos and move to different apps / turn your screen off, only show stuff you're\n        subscribed to, block ads, automatically skip sponsor segments, download videos, create folders for your\n        subscriptions, and may have other features. It really helps me to be more mindful and intentional with it.\n        I'm currently in the process of migrating to Tubular and setting that environment up.\n    </li>\n    <li>\n        There are probably alternative frontends for a lot of apps besides YouTube, I just haven't spent that much\n        time looking into it. If you use other apps a lot then it's worth looking into.\n    </li>\n    <li>\n        Quality of media consumed is important. I think the three media \"macronutrients\" are knowledge,\n        entertainment, and artistic appreciation. Try to set up your media to give you these in high-quality.\n    </li>\n    <li>\n        Avoid content that is reactionary, advertisements, hateful, low-quality slop, AI-generated, misinformation,\n        or otherwise bad content.\n    </li>\n    <li>\n        Instead of letting algorithms curate your media, curate your own media. One tool for this is RSS feeds.\n        If you get an RSS reader, you can subscribe to specific comics, blogs, news sites, even YouTube channels\n        in a unified and user-friendly way, without algorithmic curation. It takes more effort but is worth it.\n    </li>\n    <li>\n        The indie web is pretty cool. Instead of putting their work on a big corporate-owned site, some creators\n        are hosting their stuff themselves. This website is part of the indie web. No ads, trackers, censorship,\n        or comporomising your art to get more clicks. We create what we want, how we want it. You can get started\n        surfing the indie web at <a href=\"\">marginalia</a> by searching for a topic you're interested in or going\n        to the random tab. You can get started making your own website with <a href=\"\">Neocities</a> or a similar\n        service. (Don't be intimidated by creating a website, it's not that hard, anyone can do it!)\n    </li>\n    <li>\n        Limiting media consumtion to specific times, e.g. limiting social media to 6pm-7pm every day.\n        Basically intermittent fasting applied to entertainment.\n    </li>\n    <li>\n        Limiting consumption to specific formats. Long-form videos is usually better than short-form,\n        books are usually better than videos. Basically dietary restriction applied to entertainment.\n    </li>\n    <li>\n        Using separate devices for media consumption is pretty cool. I have a Kindle e-reader (I plan to switch\n        to Kobo or another brand soon), an MP3 player, and a Nintendo 3ds, this helps with being more intentional\n        about media consumption and curating a collection of high-quality media I can return to.\n    </li>\n    <li>Using art and media creation as an outlet for consumption</li>\n    <li>\n        Curation is a type of creation. Start collecting things you like, either just stored for personal use,\n        or list them on a blog or something (e.g. <a [href]=\"routes.ListAlbums\">my Albums list</a>).\n        Helps with intentionality, remembering things you like, and turning consumption into creation.\n    </li>\n    <li>Media consumption can be stacked with social connection. Movie / game night!</li>\n</ul>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Projects -->\n<h2>Projects, Creation, and Art</h2>\n<p>\n    This is about what you create and how you express yourself. Each project can be thought of as its own system,\n    especially larger-scale creations that require several parts to come together. Or an entire category of creations\n    can be thought of as a system. So the creation system has several subsystems, each subsystem (project or category)\n    having connected goals, inputs, outputs, resources, and time commitments. It may be a good idea to consider what\n    all projects you are working on, what your goals are for them, and what you want to commit to them (how many hours\n    per week, for instance). I categorize it as one \"main project\", several \"side projects\", and several \"creative\n    areas\" like playing the keyboard or drawing. I have a weekly minimum hour allocation for side projects and creative\n    stuff, and 4 hours minimum on my main project. For side projects and creative areas, I allow myself to work on\n    whatever I feel like. Sometimes I may have another main project, which receives its own time allocation, but I try\n    to minimize this when possible. You don't have to use this system, but it is definitely a good idea to be \n    intentional about spending time on your projects and reaching project goals.\n</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Career / School -->\n<h2>Career / School</h2>\n<p>\n    This is also closely tied to finances, meaning / purpose, and personal skills / growth.\n    I don't have much to say here because it's highly dependent on your specific circumstance.\n    You probably know much better than I do what you need to succeed in work and school.\n</p>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Personal skills -->\n<h2>Personal skills and Growth</h2>\n<p>\n    Ideally, you are continuously leveling up your skills and learning new stuff. Skill stacking is having multiple skills\n    that compliment each other, allowing you to be more effective than someone who specializes in one thing. There are several\n    skills that improve many areas of your life simultaneously.\n    Here's a list of some useful skills:\n</p>\n<ul>\n    <li>Learning how to learn</li>\n    <li>Social / Communication skills</li>\n    <li>Computer programming</li>\n    <li>Etiquette / Manners</li>\n    <li>Critical thinking, Researching</li>\n    <li>Emotional regulation skills</li>\n    <li>Cooking</li>\n    <li>Cleaning</li>\n    <li>Gardening</li>\n    <li>The ability to focus</li>\n    <li>Negotiation</li>\n    <li>Professional skills in your field</li>\n    <li>Car and house maintenance</li>\n</ul>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Safety, Emergencies -->\n<h2>Safety / Emergencies</h2>\n\n<p>Ensure continued health:</p>\n<ul>    \n    <li>Get vaccines</li>\n    <li>Limit alcohol, smoking, and drug use</li>\n    <li>Wear sunscreen</li>\n    <li>Regular medical testing (like blood work or disease screening)</li>\n</ul>\n\n<p>Don't die:</p>\n<ul>\n    <li>Wear your seatbelt and helmet</li>\n    <li>Keep a fire extinguisher in your house and car</li>\n</ul>\n\n<p>In case you didn't listen to the above section:</p>\n<ul>\n    <li>Get insurance, including life insurance</li>\n    <li>Get a will</li>\n</ul>\n\n<p>Respond to emergencies:</p>\n<ul>\n    <li>Emergency fund - Save $5,000 / $10,000 / 6 months of expenses / Whatever you think is best (earn interest on this)</li>\n    <li>Get dash cams and security cams (Make sure it's private and won't send your data to the company, law enforcement, etc.)</li>\n    <li>Keep first aid kits around (and know how to use them)</li>\n    <li>Take courses on CPR, first aid, etc.</li>\n</ul>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Hygiene and Appearance -->\n<h2>Hygiene and Appearance</h2>\n<p>\n    How do you present yourself to the outside world? This includes: \n</p>\n<ul>\n    <li>Fashion</li>\n    <li>Hair style</li>\n    <li>Skin care</li>\n    <li>Posture</li>\n    <li>Wear sunscreen!</li>\n    <li>Hygiene</li>\n    <li>Scents</li>\n</ul>\n<!-- #endregion -->\n\n<hr />\n\n<!-- #region Dependents -->\n<h2>Dependents</h2>\n<p>\n    If you have any dependents, such as children, pets, or anyone else you take care of, then you should\n    work to ensure they have a good life. It might be beneficial to go through the entire list again with\n    them in mind to see how you could improve their life.\n</p>\n<!-- #endregion -->","tags":["Life Systems"],"created":"4/9/2025","edited":"4/15/2025","epistemicStatus":"Mostly just my thoughts and opinions","completionStatus":"in progress"},{"slug":"favorite-albums","title":"Favorite Albums","content":"<h1 class=\"article-title\">My Favorite Albums</h1>\n<div class=\"article-meta\">\n    <span>Stable</span>\n    <span>Written 3/23/2025</span>\n    <span>Edited 3/23/2025</span>\n</div>\n\n<h2>1. Leftoverture - Kansas (1976)</h2>\n<div class=\"album-container\">\n    <img src=\"albums/Leftoverture.jpg\" alt=\"Leftoverture album cover\">\n    <p>\n        In my opinion, Kansas is one of the greatest classic rock bands ever, and Leftoverture is their best album.\n        It opens with their most famous song, Carry On Wayward Son. The rest of the songs here aren't as famous,\n        but are equally great rock songs with great lyrics and instrumental sections. Some other great Kansas albums\n        are Point of Know Return, Song for America, and Masque.\n    </p>\n</div>\n\n<h2>2. Renaissance - Beyoncé (2022)</h2>\n<div class=\"album-container\">\n    <img src=\"albums/Renaissance.png\" alt=\"Renaissance album cover\">\n    <p>\n        If you don't like cuss words or sexual themes, this album is not for you.\n        This album is very unique and makes creative decisions that make it sound unlike any other album.\n        It radiates confidence, sexuality, and love. It's groovy, with a strong beat, very catchy songs, and great transitions.\n        If this doesn't make you want to dance, I don't know what will.\n    </p>\n</div>\n\n<h2>3. Super Mario Galaxy Soundtrack</h2>\n<div class=\"album-container\">\n    <img src=\"albums/Super Mario Galaxy.jpg\" alt=\"Super Mario Galaxy album cover\">\n    <p>\n        One of the greatest video game soundtracks of all time. Even if you don't care about videogames, you will still appreciate\n        the beautiful, grand orchestral tracks. It is particularly valuable to me because I grew up playing this game when I was about\n        7 years old. Whether you're a Nintendo fan or just love classical orchestral music, you will love this album.\n    </p>\n</div>\n\n<h2>4. Kirtan Wallah - Krishna Das (2014)</h2>\n<div class=\"album-container\">\n    <img src=\"albums/kirtan-wallah.jpg\" alt=\"Kirtan Wallah album cover\">\n    <p>\n        Kirtan is Hindu devotional chanting, and Wallah is someone who performs an action, so Kirtan Wallah basically means \"someone who sings kirtan\".\n        I enjoy kirtan music a lot, and this is my favorite album in the genre I've found. The instruments and singing is beautiful,\n        and it gets even more beautiful as you learn the meaning and symbolism behind each of the chants. Radhe Govinda, for instance,\n        refers to Krishna, the embodiment of the godhead (also called Govinda), and Radha, who is Krishna's love and an embodiment of that love,\n        so when I sing \"Radhe Govinda\", I'm singing \"My love of God, God's love for us\".\n    </p>\n</div>\n\n<!-- TODO Add In Loving Memory. Here? -->\n\n<h2>5. Mother Earth's Plantasia - Mort Garson (1976)</h2>\n<div class=\"album-container\">\n    <img src=\"albums/mother-earth-plantasia.webp\" alt=\"Mother Earth's Plantasia album cover\">\n    <p>\n        This is a fun, synthy, electronic album. According to Wikipedia, Mort Garson origninally wrote this for his house plants and handed out to customers\n        of a plant store called Mother Earth, or who bought a Simmons mattress from Sears (no clue what the link to mattresses is). If you want to chill\n        with some fun music looping in the background, try this album.\n    </p>\n</div>\n\n<h2>6. American Pie - Don McLean (1971)</h2>\n<div class=\"album-container\">\n    <img src=\"albums/american-pie.jpg\" alt=\"American Pie album cover\">\n    <p>\n        Great folk rock album. It opens with the hit song of the same name, then takes the listener on a narriative journey full of sorrow,\n        humor, haunting imagery and raw emotion. All of the songs are great.\n    </p>\n</div>\n\n<h2>7. Scenery - Ryo Fukui (1976)</h2>\n<div class=\"album-container\">\n    <img src=\"albums/scenery.jpg\" alt=\"Scenery album cover\">\n    <p>\n        A beautiful jazz album with primarily piano (Fukui is a pianist but has bass and drums too). He has a unique piano style that\n        I enjoy. It's playful, comforting, cozy, and sophisticated. Pretty much all of his music is very similar, his other albums are\n        more of the same great stuff.\n    </p>\n</div>\n\n<h2>8. V - Unkonwn Mortal Orchestra (2023)</h2>\n<div class=\"album-container\">\n    <img src=\"albums/v.jpg\" alt=\"V album cover\">\n    <p>\n        This is their fifth album (hence the roman numeral V) and their latest at the time of writing. It is peaceful, cozy, fuzzy, and groovy.\n        I enjoy the mix between songs with words and instrumental segments.\n    </p>\n</div>\n\n<h2>9. Pebble Brain - Lovejoy</h2>\n<div class=\"album-container\">\n    <img src=\"albums/pebble-brain.jpeg\" alt=\"Pebble Brain album cover\">\n    <p>\n        This is a fun, energetic pop/rock EP, the sort of music I'd want to rock out to on a road trip or Karaoke night.\n    </p>\n</div>\n\n<h2>10. Nothing Lasts... But Nothing Is Lost - Shpongle (2005)</h2>\n<div class=\"album-container\">\n    <img src=\"albums/nothing-lasts.jpg\" alt=\"Shpongle album cover\">\n    <p>\n        Shpongle makes some incredible mind-bending psychedelic dance / trance music. I enjoy this one in particular because it has seemless transitions,\n        making the whole album sound like one cohesive song. It has samples of Terence McKenna (to whom the album is dedicated) and my favorite movie Waking Life.\n        Apparently it also follows 8 phases of a dream sequence. All of Shpongle's music can turn your brain into a pretzel (especially with some botanical help).\n        If you're into psychedelic culture and haven't listened to Shpongle, do yourself a favor and put this on.\n    </p>\n</div>\n\n<h2>Honorable Mentions</h2>\n<p>Albums that didn't make it into the top 10 but I enjoy (in no particular order):</p>\n<ul>\n    <li>Vicious Delicious - Infected Mushroom</li>\n    <li>So - Peter Gabriel</li>\n    <li>Raíces - Águila Real</li>\n    <li>The Mantle - Agalloch</li>\n    <li>The 5th Dimension - Lemongrass</li>\n    <li>Imaginal Disk - Magdalena Bay</li>\n    <li>Currents - Tame Impala</li>\n    <li>Just Another Diamond Day - Vashti Bunyan</li>\n    <li>Red Queen to Griffon Three - Griffon</li>\n</ul>\n","tags":[],"created":"3/23/2025","edited":"N/A","epistemicStatus":"Undisputable facts (jk)","completionStatus":"in progress"},{"slug":"selflessness","title":"Selflessness","content":"\n<p>\n    I used to think that there is no such thing as a truly selfless act. All of our actions are\n    based on our own desires, on some level. Even actions which appear to be selfless are motivated\n    by desires such as improving a friendship, feeling like I am a good person, feeling like\n    I am aligned with my own moral values, potential future reciprocity, social status, or other\n    factors which directly benefit me. If I voluntarily perform an action, doesn't that entail me\n    first wanting to do that action for some reason?\n</p>\n<p>\n    I no longer think this is a useful way to think about selfishness. I think a better framing of the\n    problem is whether or not the main motivating factor for doing an action is based on my own benefit.\n    For clarity, I will use the terms \"self-centered\" and \"non-self-centered\" actions. The motives listed\n    above (improving friendships, feeling like a good person, feeling aligned with moral values,\n    potential future reciprocity, and social status) are all ultimately rooted in one's own wellbeing.\n    I will call these \"self-centered motives\".\n</p>\n<p>\n    I don't want to imply that doing an action for a self-centered reason is morally wrong or anything \n    like that. I believe that morality comes from the action itself and not the motive. If a self-centered\n    motive produces action that benefits yourself or others, and it does not harm anyone, then that's great.\n    Many great actions were taken for self-centered reasons. There are, of course, much more nefarious\n    self-centered motives, which produce harmful actions. I obviously don't condone hurting someone else\n    for selfish greed or desire for sense gratification. It is good to encourage your own motivations that\n    cause beneficial results and discourage motivations that cause harmful results.\n</p>\n<p>\n    So self-centered motives aren't necessarily bad, and we should strive for whatever motives cause better\n    behaviour. This does not answer the original question though- can someone perform an action based on\n    non-self-centered motives?\n</p>\n<p>\n    There are trivial examples and more interesting exampes of such motives. A trivial example might be if you\n    write 100 random possible actions, then generate a random number, and do whatever action it lands on.\n    Why did you do this action? Because the dice landed on it. The motive is centered on something other than\n    your own interests. This may not work, because you could ask \"Why did you set up this dice experiment?\".\n    You did this because you wanted to prove something about motives and behaviour- it's all about your knowledge\n    and proving a point- a self-centered motive. Another trivial example is unconscious or accidental actions.\n    Why did you twitch your muscle? Why did you trip over that rock? Because that nerve happened to fire, or\n    that rock happened to be there. I feel that the original question was really about intentional, voluntary\n    actions, so this answer is also uninteresting.\n</p>\n<p>\n    A more interesting, non-trivial example is compassion. If someone were to risk their own comfort or safety\n    to help someone else, this can be done for non-selfish reasons. If you save a child from drowning and\n    someone were to ask you \"Why did you do that?\", a genuine answer might be \"Because they were in danger\n    and needed help\". Of course, there may have also been self-centered motives, such as feeling like a good\n    person or social recognition, but these reasons were probably far from the front of your mind. This\n    becomes even more salient if you're saving a loved one from drowning.\n</p>\n<p>\n    You can test this example in a thought experiment. Imagine someone is in extreme pain. Perhaps they're being\n    electrocuted and can't stop themselves. Without intervention they will suffer for multiple hours before dying.\n    You have the ability to turn it off, but it would also shock you, causing you pain and a long-term injury,\n    but you would both survive. Since this is a thought experiment, we can isolate it further- the person is\n    a complete stranger, neither of you will remember anything from this, there is no social benefit or feeling\n    like a moral person or anything like that. Even with every other motive removed, do you stop the electricity?\n    I feel that most people would say yes. There seems to be absolutely no self-centered motive to do so,\n    yet you still do. Why? Because the other person is suffering and in danger. A non-self-centered, prosocial\n    action.\n</p>\n<p>\n    I feel that, in general, if someone is in a self-centered mindset, they will have more self-centered\n    motives, and if someone is in a more selfless mindset, they will have more selfless motives.\n    As described on my <flink [href]=\"routes.Beliefs\">Core Beliefs</flink> page, my most central belief\n    is that all separation is illusory, meaning there is no true separation between different people, and\n    we are all essentially one. This can be intellectually known or experienced as a state of consciousness.\n    Intellectually thinking this way will bend your lines of reasoning towards more selfless action.\n    Directly experiencing this state of consciousness will influence your emotions and core motives.\n    Whether we have the words for it or not, I think we all experience this unitive consciousness at times,\n    especially when we see others suffering and have compassion for them, and it motivates compassionate action.\n    This is personally something I'd like to explore more, as I spend most of my time in more self-interested\n    mindsets.\n</p>\n<p>\n    Ultimately, all intentional action is caused by a chain of motives and reasoning. We can't escape the\n    fact that, at some point, our motive is \"because I want to\". Why did you help that person? Because they\n    were suffering, and I am the type of person that wants to alleviate suffering. All motives must come back\n    to ourselves, or we wouldn't actually be involved in the action. But there is variability in the primacy\n    of self-interest; sometimes the main deciding factor is self-interest, sometimes it is other-interest.\n    Considering all of this, I am comfortable saying that selfless action does actually exist and can be\n    realized in our day-to-day lives.\n</p>\n<p>\n    If you have anything to add to the conversation, please leave a comment below!\n</p>","tags":[],"created":"4/29/2025","edited":"N/A","epistemicStatus":"Opinions that are not very strongly held or well-researched at all","completionStatus":"draft"},{"slug":"genius","title":"Genius","content":"<p>\nThis website was born out of research into digital gardens, commonplace books, and personal knowledge management systems. All of these are essentially different names for the same thing- organizing your knowledge in a system which continuously grows and improves over time. One recurring theme that I've seen in that space is that personal management systems are incredibly effective ways of increasing your knowledge, writing masterpieces, and basically being a genius. Almost as if having a robust knowledge management system creates geniuses. People will sometimes list off names of notable people who kept a commonplace book or similar system as evidence of this. I don't have an opinion either way- it's plausible to me that this is true, but I'd have to learn more. Let's assume this is the case, for the sake of this article.\n</p>\n<p>\nI have also heard similar claims from the \"deep work\" movement, largely surrounding Cal Newport and his book titled \"deep work\". This group of people seek to integrate moments of deep focus in their area of expertise, as this produces way better results than \"shallow\" work. Some people call this \"flow state\"- basically the same thing. This crowd will similarly list off a dozen or so names of geniuses throughout history who were known to focus on deep work. Like knowledge management systems, it seems straightforward that doing this will produce good results. Again, let's assume that focusing on deep work does produce geniuses and masterpieces.\n</p>\n<p>\nSo here we have two tools that create genuis. The obvious next step is combining the two. What if someone were to both intentionally deepen their work and intentionally catalog their knowledge effectively? Would these two effects compound on each other? What other tools, ideas, or characteristics have multiplying effects on genius?\n</p>\n<p>\nMaybe genius isn't the word I'm looking for. I don't like when people are obsessed about IQ scores, and \"genius\" has the implication of someone being innately born with it instead of developing it over time. And intelligence isn't what I'm interested in. What I'm interested in is people who have a vision and achieve it with overwhelming success. If they want to be an artist, they revolutionize art and create new genres. People buy their masterpieces for millions of dollars. If they study science, they produce paradigm shifts that change our understanding of the universe. If they work in technology, they create computers, the internet, new coding languages, operating systems, and protocols that change the world. If they want to make the world a better place for fellow humans, they advance human rights and end wars. In all areas people are doing these insane things that I want to understand.\n</p>\n<p>\nI'll propose a few things to add to the list, in addition to deep work and personal knowledge management systems. Reading is good and fits in with knowledge management. The character traits of curiosity, and the insatiable drive to achieve your goal. Intentionally orienting all things in your life towards your goal. Having a time management system. Which of these work, and what can be added to this list?\n</p>\n<p>\nIf you have any ideas, feel free to leave them in the comment section below. I think this is an idea worth pursuing but I am only in the preliminary steps of thinking about this, so I'd love some input.\n</p>","tags":[],"created":"4/30/25","edited":"4/30/25","epistemicStatus":"","completionStatus":"seed"}]